{
    "attacker": "Attacker",
    "defender": "Defender",
    "supporter": "Supporter",
    "speedster": "Speedster",
    "all_rounder": "All Rounder",
    "special": "Special",
    "physical": "Physical",
    "other": "Other",
    "melee": "Melee",
    "ranged": "Ranged",
    "area": "Area",
    "buff": "Buff",
    "debuff": "Debuff",
    "hindrance": "Hindrance",
    "dash": "Dash",
    "recovery": "Recovery",
    "sure_hit": "Sure Hit",
    "novice": "Novice",
    "intermediate": "Intermediate",
    "expert": "Expert",
    "offense": "Offense",
    "endurance": "Endurance",
    "mobility": "Mobility",
    "scoring": "Scoring",
    "support": "Support",
    "leveling": "Leveling",
    "basic_attack": "Basic Attack",
    "bulbasaur": "Bulbasaur",
    "ivysaur": "Ivysaur",
    "venusaur": "Venusaur",
    "venusaur_basic_description": "Becomes a boosted attack with every third attack, dealing increased damage. This boosted attack also pulls opposing Pokemon inward between the user's vines.",
    "seed_bomb": "Seed Bomb",
    "seed_bomb_description": "Hurls a large seed at the designated area, dealing damage to opposing Pokemon in the area of effect.",
    "sludge_bomb_venusaur": "Sludge Bomb",
    "sludge_bomb_venusaur_description": "Hurls unsanitary sludge to the designated area, dealing damage to opposing Pokemon in the area of effect, leaving them poisoned and decreasing their movement speed and Sp. Def for a short time.",
    "sludge_bomb_venusaur_upgrade": "Increases this move's area of effect.",
    "giga_drain": "Giga Drain",
    "giga_drain_description": "Drains HP from opposing Pokemon in the area of effect, dealing damage to them and restoring the user's HP when it hits. Also reduces the damage the user receives for a short time.",
    "giga_drain_upgrade": "Increases the amount of HP this move restores.",
    "razor_leaf": "Razor Leaf",
    "razor_leaf_description": "Launches many sharp-edged leaves in a quick succession of attacks, dealing damage to opposing Pokemon in the area of effect.",
    "solar_beam": "Solar Beam",
    "solar_beam_description": "Blasts a bundled beam of light, dealing damage to opposing Pokemon in the area of effect.",
    "solar_beam_upgrade": "Reduces this move's cooldown.",
    "petal_dance": "Petal Dance",
    "petal_dance_description": "Scatters petals around the user, increasing movement speed for a short time and dealing damage over time to opposing Pokemon in the area of effect.",
    "petal_dance_upgrade": "Increases this move's area of effect.",
    "verdant_anger": "Verdant Anger",
    "verdant_anger_description": "Launches a giant seed toward the designated area. The seed then splits apart, dealing damage to opposing Pokemon in the area of effect and decreasing their movement speed for a short time.",
    "overgrow": "Overgrow",
    "overgrow_description": "When the Pokemon is at low HP, the damage it deals is increased.",
    "charmander": "Charmander",
    "charmeleon": "Charmeleon",
    "charizard": "Charizard",
    "charizard_basic_description": "Deals continuous damage. Deals increased damage to opposing Pokemon that are burned and increases in range when the user evolves.",
    "flame_burst": "Flame Burst",
    "flame_burst_description": "Attacks with a bursting flame. When this move hits, it leaves opposing Pokemon burned and increases the user's movement speed for a short time.",
    "flamethrower": "Flamethrower",
    "flamethrower_description": "Attacks with an intense blast of fire. When this move hits, it leaves opposing Pokemon burned and increases the user's movement speed for a short time.",
    "flamethrower_upgrade": "Increases this move's damage and the damage caused by burning.",
    "fire_punch": "Fire Punch",
    "fire_punch_description": "Has the user punch with a fiery fist, dealing damage and shoving opposing Pokemon when it hits. Also leaves the opposing Pokemon it shoves burned.",
    "fire_punch_upgrade": "Reduces this move's cooldown every time a basic attack hits.",
    "fire_spin": "Fire Spin",
    "fire_spin_description": "Encircles opposing Pokemon in the area of effect with a vortex of fire. After this move hits, it deals damage over time and decreases the movement speed of opposing Pokemon for a short time.",
    "fire_blast": "Fire Blast",
    "fire_blast_description": "Blasts intense, all-consuming fire, dealing damage over time to opposing Pokemon while the flames continue to burn on the ground and decreasing the movement speed of opposing Pokemon for a short time.",
    "fire_blast_upgrade": "Increases damage dealt by this move.",
    "flare_blitz": "Flare Blitz",
    "flare_blitz_description": "Has the user charge forward cloaked in fire, throwing opposing Pokemon. Also grants the user a shield.",
    "flare_blitz_upgrade": "Also decreases the movement speed of opposing Pokemon for a short time when they are thrown by this move.",
    "seismic_slam": "Seismic Slam",
    "seismic_slam_description": "Has the user grab a Pokémon from the opposing team and slam it onto the ground from the air. For a short time afterward, the user can move freely over obstacles. While this Unite Move is being used, the user’s basic attacks deal increased damage and leave opposing Pokémon burned. In addition, when the user deals damage to an opposing Pokémon, the user recovers HP.",
    "blaze_charizard": "Blaze",
    "blaze_charizard_description": "When the Pokemon is at half HP or less, its critical-hit rate is increased.",
    "pikachu": "Pikachu",
    "pikachu_basic_description": "Becomes a boosted attack with every third attack, dealing increased damage. This boosted attack also paralyzes opposing Pokemon for a short time when it hits.",
    "thunder_shock": "Thunder Shock",
    "thunder_shock_description": "Releases electricity, dealing damage to opposing Pokemon in the area of effect. Also paralyzes opposing Pokemon for a short time.",
    "electro_ball": "Electro Ball",
    "electro_ball_description": "Hurls an electric orb, dealing damage to opposing Pokemon in the area of effect and leaving them paralyzed for a short time. This move's damage increases the lower the opposing Pokemon's remaining HP is.",
    "electro_ball_upgrade": "Increases damage dealt by this move.",
    "thunder": "Thunder",
    "thunder_description": "Drops wicked thunderbolts, dealing damage to opposing Pokemon in the area of effect.",
    "thunder_upgrade": "Increase the number of attacks for this move.",
    "electro_web": "Electro Web",
    "electro_web_description": "Attacks and captures opposing Pokemon using an electric net, leaving them unable to move.",
    "volt_tackle": "Volt Tackle",
    "volt_tackle_description": "Has the user electrify itself and charge ahead, throwing opposing Pokemon.",
    "volt_tackle_upgrade": "Reduces this move's cooldown.",
    "thunderbolt": "Thunderbolt",
    "thunderbolt_description": "Attacks with a strong electric blast, dealing damage to opposing Pokemon in the area of effect and leaving them unable to act.",
    "thunderbolt_upgrade": "Increases damage dealt by this move.",
    "thunderstorm": "Thunderstorm",
    "thunderstorm_description": "Attacks opposing Pokemon near the user with tremendous bolts of lightning.",
    "static": "Static",
    "static_description": "Paralyzes all opponents near the Pokemon for a short time when the Pokemon receives damage. This Ability goes on cooldown after it's triggered.",
    "alolan_vulpix": "Alolan Vulpix",
    "alolan_ninetales": "Alolan Ninetales",
    "alolan_ninetales_basic_description": "Becomes a boosted attack with every third attack. When this boosted attack hits, it deals damage to nearby opposing Pokemon and decreases their movement speed for a short time.",
    "powder_snow": "Powder Snow",
    "powder_snow_description": "Attacks with a chilly gust of powdery snow, decreasing the movement speed of opposing Pokemon for a short time when it hits.",
    "avalanche": "Avalanche",
    "avalanche_description": "Attacks with a gush of chilly ice toward the designated area. The ice forms a wall that cannot be passed through on land. After a short time, this wall melts and collapses, dealing damage to opposing Pokemon in the area of effect.",
    "avalanche_upgrade": "Also decreases the movement speed of opposing Pokemon for a short time when this move hits.",
    "dazzling_gleam_ninetales": "Dazzling Gleam",
    "dazzling_gleam_ninetales_description": "Attacks with a powerful cone of blinding light, leaving opposing Pokemon unable to act when this move hits.",
    "dazzling_gleam_ninetales_upgrade": "Increases damage dealt and the length of time opposing Pokemon are unable to act.",
    "icy_wind": "Icy Wind",
    "icy_wind_description": "Attacks with a gust of freezing air, dealing damage to opposing Pokemon in the area of effect and decreasing their movement speed for a short time when it hits.",
    "blizzard": "Blizzard",
    "blizzard_description": "Summons a howling blizzard in two blasts in front of the user. The first blast deals damage to opposing Pokemon in the area of effect and decreases their movement speed for a short time. The second blast deals damage to opposing Pokemon in the area of effect and shoves them. If the second blast hits an obstacle, it also deals damage to opposing Pokemon near the point of impact.",
    "blizzard_upgrade": "Increases damage dealt by this move.",
    "aurora_veil": "Aurora Veil",
    "aurora_veil_description": "Creates an aurora around the user that reduces damage received by the user and ally Pokemon in the area of effect. While the user is inside the aurora, its movement speed is increased and its basic attacks become boosted attacks.",
    "aurora_veil_upgrade": "Further reduces damage ally Pokemon receive.",
    "snow_globe": "Snow Globe",
    "snow_globe_description": "Attacks with a chilly snow and ice, dealing damage to opposing Pokemon in the area of effect when it hits. Deals increased damage to opposing Pokemon that are frozen.",
    "snow_warning": "Snow Warning",
    "snow_warning_description": "Causes snow to fall on an opposing Pokemon, dealing damage to it and decreasing its movement speed for a short time. Boosted attacks and moves (except Aurora Veil) sling snow, and hitting the same target with snow multiple times will freeze it for a short time.",
    "jigglypuff": "Jigglypuff",
    "wigglytuff": "Wigglytuff",
    "wigglytuff_basic_description": "Becomes a boosted attack with every third attack, dealing damage to opposing Pokemon and spinning them around when it hits.",
    "pound": "Pound",
    "pound_description": "Has the user perform a combo attack in front of itself, dealing damage to opposing Pokemon and decreasing their movement speed for a short time when the attack hits.",
    "double_slap": "Double Slap",
    "double_slap_description": "Has the user perform a combo attack in front of itself, dealing damage to opposing Pokemon and decreasing their movement speed for a short time when the attack hits.",
    "double_slap_upgrade": "Increases the number of attacks for this move.",
    "dazzling_gleam_wigglytuff": "Dazzling Gleam",
    "dazzling_gleam_wigglytuff_description": "Emits a powerful flash in the designated direction, dealing damage to opposing Pokemon in the area of effect twice.",
    "dazzling_gleam_wigglytuff_upgrade": "Also decreases the movement speed of opposing Pokemon for a short time when the first hit of this move deals damage to them.",
    "defense_curl": "Defense Curl",
    "defense_curl_description": "Has the user perform a quick roll, granting it a shield and throwing any opposing Pokemon hit by the roll. Hitting an obstacle while rolling will change the direction the user is moving and reset the cooldown of Pound, Double Slap, or Dazzling Gleam.",
    "rollout": "Rollout",
    "rollout_description": "Has the user perform a quick roll, granting it a shield. Also deals damage to any opposing Pokemon hit by the roll and throws them. Hitting an obstacle while rolling will change the direction the user is moving and reset the cooldown of Pound, Double Slap, or Dazzling Gleam.",
    "rollout_upgrade": "Increases the length of time opposing Pokemon are thrown.",
    "sing": "Sing",
    "sing_description": "Has the user sing, decreasing the movement speed of nearby opposing Pokemon for a short time. Opposing Pokemon that stay in the move's area of effect for a while are put to sleep for a short time, which also decreases their Defense and Sp. Def.",
    "sing_upgrade": "Increases the length of time that opposing Pokemon stay asleep.",
    "star_recital": "Star Recital",
    "star_recital_description": "Has the user begin performing a recital, granting itself and nearby ally Pokemon a shield as well as removing all status conditions from the affected Pokemon and making them immune to hindrances for a short time.",
    "cute_charm": "Cute Charm",
    "cute_charm_description": "When a Pokemon is hit by an opposing Pokemon's attack at close range, it makes that opposing Pokemon infatuated for a short time. Infatuated opposing Pokemon become enthralled and approach the infatuating Pokemon against their will. The effects of this Ability have a cooldown and cannot trigger on the same opposing Pokemon in quick succession.",
    "machop": "Machop",
    "machoke": "Machoke",
    "machamp": "Machamp",
    "machamp_basic_description": "Becomes a boosted attack with every third attack, dealing increased damage when it hits. This boosted attack also decreases the movement speed of opposing Pokemon for a short time.",
    "karate_chop": "Karate Chop",
    "karate_chop_description": "Attacks opposing Pokemon with a sharp chop.",
    "close_combat_machamp": "Close Combat",
    "close_combat_machamp_description": "Unleashes a series of punches in the designated direction, dealing increased damage with the last punch. The user can move while using this move and becomes immune to hindrances.",
    "close_combat_machamp_upgrade": "Deals increased damage to Pokemon that are affected by a status condition.",
    "cross_chop": "Cross Chop",
    "cross_chop_description": "Has the user deliver a double chop with forearms crossed while dashing forward. This also increases the user's critical-hit rate.",
    "cross_chop_upgrade": "Increases Attack with each basic attack, up to a set max.",
    "bulk_up": "Bulk Up",
    "bulk_up_description": "After using this move, the user becomes immune to hindrances for a short time, its movement speed and Attack are increased, and its basic attack speed is increased. The user's next basic attack also becomes a boosted attack.",
    "dynamic_punch": "Dynamic Punch",
    "dynamic_punch_description": "Has the user jump to the designated location, dealing damage to opposing Pokemon in the area of effect and leaving them unable to act when it hits. For a short time after using this move, the user becomes immune to hindrances and its movement speed and Attack are increased. The user's next basic attack also becomes boosted.",
    "dynamic_punch_upgrade": "Further increases Attack and movement Speed.",
    "submission": "Submission",
    "submission_description": "Increases the user's movement speed and makes it immune to hindrances. When the user's next basic attack hits, the attack deals increases damage and slams the opposing Pokemon onto the ground, leaving it unable to act. Once this move ends, the user's critical-hit rate and basic attack speed are increased for a short time.",
    "submission_upgrade": "Further increases critical-hit rate and increases basic attack speed.",
    "barrage_blow": "Barrage Blow",
    "barrage_blow_description": "Increases the user's movement speed, Attack, Defense and Sp. Def for a short time. If used again, unleashes a combo attack, dealing damage to opposing Pokemon in the area of effect and shoving them. The final blow deals an especially large amount of damage.",
    "guts": "Guts",
    "guts_description": "Increases the Pokemon's Attack when the Pokemon is afflicted by a status condition.",
    "slowpoke": "Slowpoke",
    "slowbro": "Slowbro",
    "slowbro_basic_description": "Becomes a boosted attack with every third attack. When this boosted attack hits, it deals damage to nearby opposing Pokemon and decreases their movement speed for a short time.",
    "water_gun": "Water Gun",
    "water_gun_description": "Shoots water forcefully, dealing damage to opposing Pokemon and decreasing their movement speed for a short time when it hits. Holding down the button for this move increases its area of effect and damage.",
    "scald": "Scald",
    "scald_description": "Shoots boiling hot water, dealing damage to opposing pokemon and creating steam when it hits. Opposing Pokemon inside the steam's area of effect are left burned and have their movement speed decreased for a short time.",
    "scald_upgrade": "Increases the vapor's area of effect.",
    "surf_slowbro": "Surf",
    "surf_slowbro_description": "Has the user charge forward on a wave, dealing damage to opposing Pokemon in the area of effect and throwing them. This is followed by two more waves that deal damage to opposing Pokemon in the area of effect and decrease their movement speed for a short time.",
    "surf_slowbro_upgrade": "The second and third waves become larger and also throw opposing Pokemon like the first wave does.",
    "slack_off": "Slack Off",
    "slack_off_description": "Has the user slack off, continually restoring its HP for a short time. If this slacking off is interrupted, the HP restoration effect continues at decreased power.",
    "amnesia": "Amnesia",
    "amnesia_description": "Allows the user to nullify some damage before it takes effect. For a short time after using this move, the user becomes immune to hindrances and gains increased Defense. This move also increases the damage dealt by the next use of Scald or Surf.",
    "amnesia_upgrade": "Inceases Sp. Atk.",
    "telekenisis": "Telekenisis",
    "telekenisis_description": "Makes opposing Pokemon float with psychic power. If used again, pulls the opposing Pokemon toward the user.",
    "telekenisis_upgrade": "Increases this move's firing speed and range.",
    "slowbeam": "Slowbeam",
    "slowbeam_description": "Has the user stare at one of the opposing team's Pokemon and attack continually, dealing damage and binding it. Grants the user a shield and makes the user immune to hindrances while using this move.",
    "oblivious": "Oblivious",
    "oblivious_description": "When the Pokemon receives damage, the HP loss is gradual. When hitting an opposing Pokemon with a move, the Pokemon nullifies some of this pending damage before it takes effect, and it also decreases the opposing Pokemon's Sp. Def for a short time.",
    "gastly": "Gastly",
    "haunter": "Haunter",
    "gengar": "Gengar",
    "gengar_basic_description": "Becomes a boosted attack with every third attack, lunging at an opposing Pokemon and dealing damage.",
    "will_o_wisp": "Will-O-Wisp",
    "will_o_wisp_description": "Shoots multiple sinister flames, dealing damage to opposing Pokemon and leaving them burned when it hits.",
    "shadow_ball": "Shadow Ball",
    "shadow_ball_description": "Hurls a shadowy blob at the target, decreasing the movement speed and Sp. Def of opposing Pokemon for a short time when it hits.",
    "shadow_ball_upgrade": "Increases damage dealt by this move.",
    "sludge_bomb_gengar": "Sludge Bomb",
    "sludge_bomb_gengar_description": "Hurls unsanitary sludge to the designated area, leaving opposing Pokemon poisoned when it hits.",
    "sludge_bomb_gengar_upgrade": "Increases the poison effect's duration.",
    "lick": "Lick",
    "lick_description": "Attacks with the user's tongue and pulls opposing Pokemon toward the user.",
    "dream_eater": "Dream Eater",
    "dream_eater_description": "Puts opposing Pokemon to sleep when it hits. If used again while a nearby opposing Pokemon is asleep, the user appears behind the sleeping Pokemon and attacks, restoring the user's HP and reducing the cooldown of Shadow Ball or Sludge Bomb.",
    "dream_eater_upgrade": "Increases the amount of damage dealt and HP restored by this move.",
    "hex": "Hex",
    "hex_description": "Has the user disappear and move to the designated location, dealing damage to opposing Pokemon in the area of effect when the user reappears. If this hits an opposing Pokemon that is afflicted by a status condition, it deals increased damage and its cooldown is reduced.",
    "hex_upgrade": "Increases damage dealt by this move.",
    "phantom_ambush": "Phantom Ambush",
    "phantom_ambush_description": "Has the user jump to the designated area and start sneaking with increased movement speed. If the Unite Move is used again, it deals damage to opposing Pokemon in the area of effect and decreases their movement speed for a short time.",
    "levitate": "Levitate",
    "levitate_description": "When the Pokemon is not in combat, its movement speed is increased.",
    "mr_mime": "Mr Mime",
    "mime_basic_description": "Becomes a boosted attack with every third attack, dealing increased damage and throwing opposing Pokemon when it hits.",
    "fake_out": "Fake Out",
    "fake_out_description": "Has the user slap its hands together, shoving opposing Pokemon in front of it.",
    "confusion_mime": "Confusion",
    "confusion_mime_description": "Attacks straight in front of the user, dealing damage to opposing Pokemon and shoving it. If an opposing Pokemon shoved by this move hits an obstacle, it receives increased damage from this move and is left unable to act for a short time. If the opposing Pokemon is currently guard-swapped, it is not shoved but receives increased damage from this move and is left unable to act for a short time.",
    "confusion_mime_upgrade": "Increases damage dealt by this move.",
    "psychic_mime": "Psychic",
    "psychic_mime_description": "Centers one telekinetic blast each on the user, any guard-swapped opposing Pokemon, and any Light Screen or Barrier walls created by the user, damaging all opposing Pokemon caught in the blasts and lowering their Sp. Def for a short time. If an opposing Pokemon is hit by multiple overlapping blasts, that Pokemon is also left unable to act for a short time.",
    "psychic_mime_upgrade": "Increases damage dealt and the length of time opposing Pokemon are unable to act.",
    "light_screen": "Light Screen",
    "light_screen_description": "Creates a wall of light in the designated area that prevents opposing Pokemon from passing.",
    "barrier": "Barrier",
    "barrier_description": "Creates a translucent wall in the designated location that prevents opposing Pokemon from passing. A maximum of two uses can be kept in reserve for this move.",
    "barrier_upgrade": "Increases the maximum number of uses that can be kept in reserve for this move.",
    "guard_swap": "Guard Swap",
    "guard_swap_description": "Swaps the user's Defense and Sp. Def stats with those of another Pokemon for a short time when it hits. Swapping with an opposing Pokemon deals it damage over time and decreases its movement speed while increasing the user's movement speed for a short time. Swapping with an ally Pokemon increases the movement speed of that Pokemon and the user for a short time.",
    "guard_swap_upgrade": "Also continually restores the HP of the user and the ally Pokemon while this move is in effect.",
    "showtime": "Showtime",
    "showtime_description": "Has the user jump to the designated location and start a pantomime performance, dealing damage over time to opposing Pokemon in the area of effect and leaving them unable to act for a short time.",
    "filter": "Filter",
    "filter_description": "Reduces damage received by the Pokemon for a short time after it uses a move.",
    "snorlax": "Snorlax",
    "snorlax_basic_description": "Becomes a boosted attack with every third attack. When this boosted attack hits, it deals damage to nearby opposing Pokemon and decreases their movement speed for a short time.",
    "tackle": "Tackle",
    "tackle_description": "Has the user charge forward belly first, dealing damage when it hits and shoving the first opposing Pokemon it comes in contact with. After this move, the user's next basic attack becomes boosted.",
    "heavy_slam": "Heavy Slam",
    "heavy_slam_description": "Has the user slam their heavy body down, dealing damage to opposing Pokemon in the area of effect and throwing them.",
    "heavy_slam_upgrade": "Increases damage dealt by this move.",
    "flail": "Flail",
    "flail_description": "Has the user flail about, increasing the user's basic attack damage the lower the user's remaining HP is. The user's basic attacks that hit will also decrease the movement speed of opposing Pokemon for a short time.",
    "flail_upgrade": "Increases the damage of this move. If the user has low HP while using this move, its basic attacks that hit opposing Pokemon will restore the user's HP.",
    "rest": "Rest",
    "rest_description": "Has the user fall asleep on the spot and restores its HP. Blocks the movement of all Pokemon not on the user's team while this move is in effect.",
    "block": "Block",
    "block_description": "Has the user spread their arms wide to create a wall and grants it a shield. Prevents opposing Pokemon from passing through the wall and shoves them if they run into it.",
    "block_upgrade": "Reduces the damage the user receives while this move is in effect.",
    "yawn": "Yawn",
    "yawn_description": "Has the user let loose a huge yawn that lulls opposing Pokemon into a sleepy haze, putting opposing Pokemon hit by this move to sleep.",
    "yawn_upgrade": "Also decreases the movement speed of opposing Pokemon for a short time when this move hits.",
    "power_nap": "Power Nap",
    "power_nap_description": "Has the user go to sleep and begin to snore, dealing damage over time to opposing Pokemon in the area of effect and throwing them. While sleeping, the user becomes immune to hindrances and its HP is continually restored.",
    "gluttony": "Gluttony",
    "gluttony_description": "Increases the effects gained from eating Berries.",
    "ralts": "Ralts",
    "kirlia": "Kirlia",
    "gardevoir": "Gardevoir",
    "gardevoir_basic_description": "Becomes a boosted attack with every third attack. When this boosted attack hits, it deals damage to opposing Pokemon in the area of effect and decreases their Sp. Def for a short time.",
    "confusion_gardevoir": "Confusion",
    "confusion_gardevoir_description": "Attacks straight in the designated direction.",
    "psychic_gardevoir": "Psychic",
    "psychic_gardevoir_description": "After hitting an opposing Pokemon or traveling its maximum distance, deals damage over time to opposing Pokemon in the area of effect. If this move deals damage over time due to hitting an opposing Pokemon, it also decreases the Sp. Def and movement speed of that Pokemon for a short time.",
    "psychic_gardevoir_upgrade": "Reduces this move's cooldown.",
    "moonblast": "Moonblast",
    "moonblast_description": "Has the user attack while moving back to create distance. When the move's blast hits, it deals damage to opposing Pokemon in a cone and leaves the opposing Pokemon closest to the user unable to act for a short time.",
    "moonblast_upgrade": "Also grants the user a shield when this move is used.",
    "teleport": "Teleport",
    "teleport_description": "Has the user warp to the designated area, increasing the damage dealt by one basic attack after warping.",
    "psyshock": "Psyshock",
    "psyshock_description": "Attacks the designated location three times. This move's cooldown is reduced each time one of these attacks hits an opposing Pokemon.",
    "psyshock_upgrade": "Also increases the damage this move deals each time one of its attacks hits.",
    "future_sight": "Future Sight",
    "future_sight_description": "Sets a delayed explosion. When the explosion hits a Pokemon from the opposing team, it shortens this move's cooldown.",
    "future_sight_upgrade": "Resets this move's cooldown when the explosion hits a Pokemon from the opposing team.",
    "fairy_singularity": "Fairy Singularity",
    "fairy_singularity_description": "Warps space in the designated area, drawing in opposing Pokemon. Shoves and deals damage to opposing Pokemon the instant the warped space disappears.",
    "synchronize": "Synchronize",
    "synchronize_description": "When an opponent inflicts decreased movement speed or a damage-over-time condition on the Pokemon, the same is inflicted on that opponent. This Ability goes on cooldown after it's triggered.",
    "absol": "Absol",
    "absol_basic_description": "Becomes a boosted attack with every third attack, dealing damage to opposing Pokemon and decreasing their Defense when it hits. If this boosted attack hits only a single opposing Pokemon, it deals increased damage.",
    "feint_absol": "Feint",
    "feint_absol_description": "Has the user dash in an arc, attacking opposing Pokemon they come in contact with. This move ignores the Defense stat and shield effects of opposing Pokemon.",
    "night_slash": "Night Slash",
    "night_slash_description": "Has the user dash in an outward arc, dealing damage to opposing Pokemon. If the first attack hits, a second attack can also be performed. The second attack has the user dash straight ahead, dealing damage to opposing Pokemon and increasing the user's critical-hit rate. The lower the opposing Pokemon's HP, the more the user's critical-hit rate is increased.",
    "night_slash_upgrade": "Using this move again will restore the user's HP.",
    "pursuit": "Pursuit",
    "pursuit_description": "Has the user dash to the designated location and quickly charge an opposing Pokemon with the next basic attack. If the basic attack lands from behind, its damage is increased and this move's cooldown is reduced",
    "pursuit_upgrade": "Increases the user's movement speed.",
    "slash_absol": "Slash",
    "slash_absol_description": "Slashes with sharp claws in front of the user, increasing this move's critical-hit rate.",
    "psycho_cut": "Psycho Cut",
    "psycho_cut_description": "Has the user attack with blades formed by psychic power that decrease the movement speed of opposing Pokemon for a short time when the move hits. Also increases basic attack damage dealt to the affected opposing Pokemon for up to three attacks after this move hits.",
    "psycho_cut_upgrade": "Also increases the user's movement speed for a short time when the user gets close to the opposing Pokemon that this move hit.",
    "sucker_punch": "Sucker Punch",
    "sucker_punch_description": "Has the user look for an opening to attack an opposing Pokemon, decreasing the movement speed of the user and the opposing Pokemon for the duration. After a short time, the user charges to attack the opposing Pokemon. However, if the user receives damage or gets attacked before it charges, it attacks immediately and shoves the opposing Pokemon.",
    "sucker_punch_upgrade": "Increases basic attack speed for a short time when this move hits.",
    "midnight_slash": "Midnight Slash",
    "midnight_slash_description": "Unleashes a flurry of slashes in front of the user. This move ends by unleashing powerful blades of energy, dealing increased damage to opposing Pokemon and shoving them.",
    "super_luck": "Super Luck",
    "super_luck_description": "Increases the Pokemon's critical-hit rate.",
    "gible": "Gible",
    "gabite": "Gabite",
    "garchomp": "Garchomp",
    "garchomp_basic_description": "Becomes a boosted attack with every fifth attack, dealing increased damage and restoring the user's HP. For a short time after a boosted attack hits, every time one of the user's basic attacks or moves hits an opposing Pokemon, the user's basic attack speed is increased.",
    "sand_attack": "Sand Attack",
    "sand_attack_description": "Hurls sand, narrowing the field of vision of opposing Pokemon and decreasing their movement speed for a short time when it hits. This also increases the user's movement speed and basic attack speed.",
    "dig": "Dig",
    "dig_description": "Has the user burrow underground and move out quickly in the designated direction, jumping out when it comes in contact with an opposing Pokemon or when it has traveled the maximum distance. This jump deals damage to opposing Pokemon in the area of effect and throws them.",
    "dig_upgrade": "Reduces the damage the user receives for a short time after it jumps out from underground.",
    "dragon_rush": "Dragon Rush",
    "dragon_rush_description": "Has the user back up to create distance before diving to attack in the designated direction, shoving opposing Pokemon. The user can use Dragon Claw while creating distance at the beginning of this move to create a combo attack.",
    "dragon_rush_upgrade": "Also decreases the movement speed of opposing Pokemon for a short time when they are shoved by this move the maximum distance.",
    "bulldoze": "Bulldoze",
    "bulldoze_description": "Has the user stomp down on the ground, dealing damage to opposing Pokemon in the area of effect.",
    "earthquake": "Earthquake",
    "earthquake_description": "Has the user jump high into the air and crash forcefully to the ground, dealing damage to opposing Pokemon in the area of effect.",
    "earthquake_upgrade": "Also decreases the movement speed of opposing Pokemon for a short time if they are in this move's area of effect.",
    "dragon_claw": "Dragon Claw",
    "dragon_claw_description": "Has the user attack twice in front of itself using its claws. The first attack deals damage to opposing Pokemon and then throws them, and the second deals increased damage. After the move ends, the user's basic attack speed is increased for a short time.",
    "dragon_claw_upgrade": "Increases damage dealt by this move.",
    "livid_outrage": "Livid Outrage",
    "livid_outrage_description": "Has the user unleash a powerful chain attack while dashing forward. The final attack throws opposing Pokemon but also leaves the user unable to act for a short time.",
    "rough_skin": "Rough Skin",
    "rough_skin_description": "When the Pokemon is struck by a melee attack, a portion of the damage received is reflected back at the attacker.",
    "lucario": "Lucario",
    "lucario_basic_description": "Becomes a boosted attack with every third attack, performing a combo attack with a bone. Deals damage to opposing Pokemon in the area of effect and throws them.",
    "quick_attack": "Quick Attack",
    "quick_attack_description": "Has the user lunge forward at a speed that makes them almost invisible, dealing damage to opposing Pokemon it comes in contact with.",
    "extreme_speed": "Extreme Speed",
    "extreme_speed_description": "Has the user charge forward with breathtaking speed. If this move hits an opposing Pokemon from point-blank range, its cooldown is reset and it restores the user's HP. However, the cooldown cannot be continually reset by using this move on the same opponent multiple times in succession.",
    "extreme_speed_upgrade": "Also increases Attack for a short time when this move is used.",
    "power_up_punch": "Power-Up Punch",
    "power_up_punch_description": "Charges power before unleashing a powerful attack. While the user is charging power, its movement speed is decreased but its Attack slowly increases and the damage it receives is reduced. The user then charges in the designated direction and releases the move, dealing more damage the lower the opposing Pokemon's remaining HP is and making its own next basic attack a boosted attack if the move hits. This move's cooldown is reduced every time one of the user's move hits.",
    "power_up_punch_upgrade": "The user becomes immune to hindrances while charging power.",
    "meteor_mash": "Meteor Mash",
    "meteor_mash_description": "Blasts forward with a punch like a comet, dealing damage to opposing Pokemon and shoving them.",
    "bone_rush": "Bone Rush",
    "bone_rush_description": "Performs a combo attack with a bone, dealing multiple damaging blows to opposing Pokemon and shoving them. The final attack sends the bone flying. If this move is used again while the bone is traveling, the user rushes to the location of the bone, dealing damage to nearby opposing Pokemon.",
    "bone_rush_upgrade": "Using this move again will reset the cooldown for Extreme Speed or Power-Up Punch.",
    "close_combat_lucario": "Close Combat",
    "close_combat_lucario_description": "Unleashes a combo attack, dealing multiple blows to opposing Pokemon.",
    "close_combat_lucario_upgrade": "Increases damage dealt by this move.",
    "aura_cannon": "Aura Cannon",
    "aura_cannon_description": "Damages all opposing Pokemon in the area of effect. Increases the damage dealt by the user's next Power-Up Punch after using this Unite Move.",
    "steadfast": "Steadfast",
    "steadfast_description": "When the Pokemon is at low HP, it is granted a shield and its movement speed is increased.",
    "dwebble": "Dwebble",
    "crustle": "Crustle",
    "crustle_basic_description": "Becomes a boosted attack with every third attack. When this boosted attack hits, it deals damage to opposing Pokemon in the area of effect and decreases their movement speed for a short time.",
    "rock_slide": "Rock Slide",
    "rock_slide_description": "Drops large rocks on the designated area. When this move hits, it deals damage to opposing Pokemon in the area of effect and leaves them unable to act for a short time.",
    "rock_tomb": "Rock Tomb",
    "rock_tomb_description": "Splits open the ground toward the designated area, dealing damage to opposing Pokemon in the area of effect and creating a barricade of rock. If used again, gets rid of the barricade.",
    "rock_tomb_upgrade": "Also decreases the movement speed of opposing Pokemon for a short time when this move hits.",
    "shell_smash": "Shell Smash",
    "shell_smash_description": "Has the user smash its shell, converting a set percentage of Defense and Sp. Def into Attack and Sp. Atk and increasing the user's movement speed for a short time.",
    "shell_smash_upgrade": "Increases this move's conversion rate.",
    "fury_cutter": "Fury Cutter",
    "fury_cutter_description": "Slashes opposing Pokemon with claws, dealing damage to them. Hitting the same opposing Pokemon multiple times in succession with this move increases the damage dealt.",
    "stealth_rock": "Stealth Rock",
    "stealth_rock_description": "Throws many small rocks. When a rock hits an opposing Pokemon, or when the rocks have flown their full distance, a zone of many levitating rocks is created, dealing slowly-increasing damage over time to opposing Pokemon in the area of effect.",
    "stealth_rock_upgrade": "Increases the duration of this move's effects and decreases the movement speed of opposing Pokemon for a short time when this move hits.",
    "x_scissor": "X Scissor",
    "x_scissor_description": "Has the user dash forward with crossed claws, dealing damage to opposing Pokemon multiple times and shoving them. Leaves opposing Pokemon unable to act if they hit an object when shoved.",
    "x_scissor_upgrade": "Reduces this move's cooldown.",
    "rubble_rouser": "Rubble Rouser",
    "rubble_rouser_description": "Grants the user a shield for a short time and leaves nearby opposing Pokemon unable to act, dealing them damage over time. If the user receives damage while this move is in effect, the move deals additional hits to nearby Pokemon.",
    "sturdy": "Sturdy",
    "sturdy_description": "Every time the Pokemon loses a certain amount of HP, its Defense and Sp. Def are increased.",
    "froakie": "Froakie",
    "frogadier": "Frogadier",
    "greninja": "Greninja",
    "greninja_basic_description": "Becomes a boosted attack with every third attack. At long range, a boosted attack deals increased damage to opposing Pokemon and decreases their movement speed for a short time. At close range, a boosted attack deals more damage the lower the opposing Pokemon's remaining HP is.",
    "bubble": "Bubble",
    "bubble_description": "Attacks with a spray of bubbles, decreasing the movement speed of opposing Pokemon for a short time when it hits.",
    "water_shuriken": "Water Shuriken",
    "water_shuriken_description": "Throws shurikens made of water in quick succession. Decreased the movement speed of opposing Pokemon for a short time and restores the user's HP when it hits. Also increases the user's movement speed while using this move.",
    "water_shuriken_upgrade": "Increases the number of attacks for this move.",
    "surf_greninja": "Surf",
    "surf_greninja_description": "Has the user ride a wave, dealing damage to opposing Pokemon and restoring the user's HP. If this move knocks out an opposing Pokemon, its cooldown is reset. In addition, this move deals increased damage to opposing Pokemon with low HP.",
    "surf_greninja_upgrade": "Increases the amount of HP restored.",
    "substitute": "Substitute",
    "substitute_description": "Leaves behind a Substitute doll for the user while it's moving forward.",
    "double_team": "Double Team",
    "double_team_description": "Quickly moves the user away from the current position, creating illusory copies of it to aid in battle.",
    "double_team_upgrade": "Reduces this move's cooldown.",
    "smokescreen": "Smokescreen",
    "smokescreen_description": "Creates a smokescreen and has the user roll away from its current location. Immediately afterward, the user begins sneaking and has its movement speed increased for a short time. This also makes its next basic attack a boosted attack.",
    "smokescreen_upgrade": "Increases Attack for a short time when the user stops sneaking.",
    "waterburst_shuriken": "Waterburst Shuriken",
    "waterburst_shuriken_description": "Has the user throw a giant water shuriken toward the designated area, dealing damage to opposing Pokemon in the area of effect and decreasing their movement speed for a short time when this Unite Move hits. The water shuriken then immediately explodes, dealing damage to opposing Pokemon in the area of effect once again and throwing them. Once this Unite Move ends, the user may jump in a designated direction.",
    "torrent": "Torrent",
    "torrent_description": "When the Pokemon is at half HP or less, its Attack and movement speed are increased.",
    "fletchling": "Fletchling",
    "fletchinder": "Fletchinder",
    "talonflame": "Talonflame",
    "talonflame_basic_description": "Becomes a boosted attack with every third attack, creating a fiery whirlwind that deals damage to opposing Pokemon in the area of effect. This boosted attack remains readied even if the user leaves combat for a prolonged period of time after the first two basic attacks.",
    "peck": "Peck",
    "peck_description": "Has the user fly toward an opposing Pokemon and attack three times.",
    "flame_charge_talonflame": "Flame Charge",
    "flame_charge_talonflame_description": "Has the user fly in the designated direction while cloaked in flame, attacking opposing Pokemon in its path. Also increases the user's movement speed for a short time.",
    "flame_charge_talonflame_upgrade": "For a short time after this move hits, the user's moves and basic attacks partially ignore opposing Pokemon's Defense.",
    "aerial_ace": "Aerial Ace",
    "aerial_ace_description": "Has the user fly at the designated opposing Pokemon, dealing damage. Also makes the user's next basic attack a boosted attack.",
    "aerial_ace_upgrade": "Increases damage dealt by this move.",
    "acrobatics": "Acrobatics",
    "acrobatics_description": "Has the user fly toward the designated area and attack multiple times. Allows the user to escape in a direction of its choice after using this move.",
    "fly": "Fly",
    "fly_description": "Has the user fly up into the sky. If used again, has the user dive to the designated area and attack, dealing damage to opposing Pokemon in the area of effect. Also makes the user's next basic attack a boosted attack.",
    "fly_upgrade": "Also throws opposing Pokemon when this move hits.",
    "brave_bird": "Brave Bird",
    "brave_bird_description": "Has the user dive to the designated location while cloaked in flame, dealing damage to opposing Pokemon in the area of effect. Also deals recoil damage to the user when it hits. Performing a boosted attack within a set amount of time after this move hits will reset the cooldown for Flame Charge or Aerial Ace.",
    "brave_bird_upgrade": "Reduces damage received when this move hits.",
    "flame_sweep": "Flame Sweep",
    "flame_sweep_description": "Has the user perform an aerial somersault before charging forward, dealing damage to opposing Pokemon in this move's path and shoving them.",
    "gale_wings": "Gale Wings",
    "gale_wings_description": "When the Pokemon is at high HP, its movement speed is increased.",
    "zeraora": "Zeraora",
    "zeraora_basic_description": "Becomes a boosted attack with every third attack, dealing increased damage when it hits. Also paralyzes opposing Pokemon and restores the user's HP.",
    "agility": "Agility",
    "agility_description": "Has the user perform a quick dash and increases the user's basic attack speed for a short time afterward.",
    "volt_switch": "Volt Switch",
    "volt_switch_description": "Has the user perform a high-speed dash, dealing damage to any opposing Pokemon it hits and increasing the user's basic attack speed for a short time. Using this move again within a set period of time will allow the user to immediately dash back to where it originally used the move.",
    "volt_switch_upgrade": "Increases this move's damage and further increases basic attack speed.",
    "spark": "Spark",
    "spark_description": "Has the user leap at an opposing Pokemon while electrically charged, dealing damage to them. If the user uses its basic attack before reaching its target Pokemon, the user will instead leap at the closest opposing Pokemon, dealing damage to it. This move can be used three times before it goes on cooldown.",
    "spark_upgrade": "Also restores the user's HP if the user performs a basic attack before reaching its target Pokemon.",
    "slash_zeraora": "Slash",
    "slash_zeraora_description": "Has the user pounce at an opposing Pokemon and attack with sharp claws. This move's final attack throws opposing Pokemon.",
    "discharge": "Discharge",
    "discharge_description": "Releases an electric discharge, dealing damage to nearby opposing Pokemon and granting the user a shield when it hits. If this move hits opposing Pokemon that are paralyzed, it pulls them in toward the user once the move ends, dealing damage to them once again and leaving them unable to act.",
    "discharge_upgrade": "Also decreases the movement speed of opposing Pokemon for a short time when this move hits.",
    "wild_charge": "Wild Charge",
    "wild_charge_description": "Has the user charge in the designated direction. If this move hits an opposing Pokemon, the user unleashes a combo attack that also deals a set amount of damage to itself. If the user hits an oppposing Pokemon with Volt Switch, Spark or a boosted attack before using this move, the number of attacks in the combo is increased.",
    "wild_charge_upgrade": "This move also deals damage to nearby opposing Pokemon when it hits.",
    "plasma_gale": "Plasma Gale",
    "plasma_gale_description": "Unleashes a blast of lightning, dealing damage to opposing Pokemon in the area of effect and throwing them. This also creates a zone of plasma that increases the user's basic attack range and damage dealt while the user is inside the zone.",
    "volt_absorb": "Volt Absorb",
    "volt_absorb_description": "The Pokemon gains an electric charge whenever it receives damage, converting a portion of that damage into additional Attack.",
    "scorbunny": "Scorbunny",
    "raboot": "Raboot",
    "cinderace": "Cinderace",
    "cinderace_basic_description": "Becomes a boosted attack with every third attack, dealing increased damage when it hits.",
    "ember": "Ember",
    "ember_description": "Shoots out a small flame, dealing damage to opposing Pokemon, leaving them burned and decreasing their Attack for a short time.",
    "pyro_ball": "Pyro Ball",
    "pyro_ball_description": "Has the user kick a ball of flame in the designated direction, dealing damage to opposing Pokemon and leaving them burned for a short time when this move hits.",
    "pyro_ball_upgrade": "Reduces the cooldown of Flame Charge or Feint when this move hits.",
    "blaze_kick": "Blaze Kick",
    "blaze_kick_description": "Has the user perform a fiery flying kick. This move is always a critical hit, and it shoves opposing Pokemon and leaves them burned for a short time. In addition, the user becomes immune to hindrances while using this move.",
    "blaze_kick_upgrade": "Increases basic attack speed for a short time when this move hits.",
    "low_sweep": "Low Sweep",
    "low_sweep_description": "Has the user make a swift low sweep in the designated direction, dealing damage to any opposing Pokemon it hits.",
    "flame_charge_cinderace": "Flame Charge",
    "flame_charge_cinderace_description": "Has the user charge forward cloaked in flame, dealing damage to any opposing Pokemon it hits.",
    "flame_charge_cinderace_upgrade": "The user's next boosted attack after this move ends also decreases the movement speed of opposing Pokemon for a short time when it hits.",
    "feint_cinderace": "Feint",
    "feint_cinderace_description": "Increase the user's movement speed for a short time and makes the user invincible.",
    "feint_cinderace_upgrade": "After this move is used, basic attacks that hit opposing Pokemon restore the user's HP (up to three times).",
    "blazing_bicycle_kick": "Blazing Bicycle Kick",
    "blazing_bicycle_kick_description": "Has the user create a giant ball of flame and kick it toward the designated location. The ball released a fierce shock wave that deals damage to opposing Pokemon in the area of effect. This Unite Move also increases the user's movement speed for a short time when it hits.",
    "blaze_cinderace": "Blaze",
    "blaze_cinderace_description": "When the Pokemon uses a move, its next basic attack becomes a boosted attack. When the Pokemon hits an opposing Pokemon with a basic attack or move, a cinder is placed on that opposing Pokemon. Attacking a cindered opposing Pokemon a certain number of times will cause the cinder to flare, dealing damage to the opposing Pokemon. When the Pokemon with this ability is at half HP or less, its critical-hit rate and basic attack speed are increased for a short time",
    "gossifleur": "Gossifleur",
    "eldegoss": "Eldegoss",
    "eldegoss_basic_description": "Becomes a boosted attack with every third attack, attaching a bit of cotton fluff to opposing Pokemon. The user's basic attacks against an opposing Pokemon with cotton fluff on it deal increased damage and decrease the opposing Pokemon's movement speed for a short time.",
    "leafage": "Leafage",
    "leafage_description": "Pelts the target with leaves, decreasing the movement speed of opposing Pokemon for a short time when it hits.",
    "pollen_puff": "Pollen Puff",
    "pollen_puff_description": "Throws a Pollen Puff, which attaches to a Pokemon. The Pollen Puff restores HP for ally Pokemon and deals damage to opposing Pokemon.",
    "pollen_puff_upgrade": "If a Pollen Puff attaches to opposing Pokemon, it deals them damage over time. If a Pollen Puff attaches to ally Pokemon, it also reduces the damage they receive.",
    "leaf_tornado": "Leaf Tornado",
    "leaf_tornado_description": "Attacks with a tornado of sharp leaves, leaving a path in its wake that increase ally Pokemon's movement speed for a short time.",
    "leaf_tornado_upgrade": "Also decreases the accuracy of opposing Pokemon for a short time when this move hits.",
    "synthesis": "Synthesis",
    "synthesis_description": "Restores the HP of the user and nearby ally Pokemon.",
    "cotton_guard": "Cotton Guard",
    "cotton_guard_description": "Protects the user and nearby ally Pokemon with cotton. The cotton absorbs damage, and when the move ends, the cottton restores some HP.",
    "cotton_guard_upgrade": "Increases the user's movement speed while using this move.",
    "cotton_spore": "Cotton Spore",
    "cotton_spore_description": "Gathers spores around the user, increasing the user's movement speed while this move is in effect. The spores burst after a short time, dealing damage to opposing Pokemon in the area of effect, throwing them, and decreasing their movement speed for a short time.",
    "cotton_spore_upgrade": "Also reduces the damage the user receives while using this move.",
    "cotton_cloud_crash": "Cotton Cloud Crash",
    "cotton_cloud_crash_description": "Has the user float into the air and become invincible. If used again, has the user pound the ground, attacking and shoving opposing Pokemon and restoring HP to ally Pokemon in the area of effect.",
    "cotton_down": "Cotton Down",
    "cotton_down_description": "Damages an opponent and decreases its movement speed for a short time after the Pokemon with this Ability receives a certain amount of damage. When that happens, the Pokemon also recovers HP and has its movement speed increased for a short time.",
    "cramorant": "Cramorant",
    "cramorant_basic_description": "Becomes a boosted attack with every third attack. This boosted attack spits Arrokuda or other Pokemon at opposing Pokemon and deals damage to opposing Pokemon near the target when it hits.",
    "whirlpool": "Whirlpool",
    "whirlpool_description": "Creates a whirlpool that deals damage to opposing Pokemon in the area of effect. This move's area of effect slowly shrinks, but the damage dealt slowly increases. Just before the whirlpool disappears, it decreases the movement speed of opposing Pokemon in the area of effect for a short time. The user can also catch Arrokuda or other prey by entering the whirlpool.",
    "surf": "Surf",
    "surf_description": "Attacks with a wave that deals damage to opposing Pokemon. Once the wave has traveled its full distance, it returns the way it came, dealing damage to opposing Pokemon once again and pulling them back with the wave. The user can also catch Arrokuda or other prey by entering the wave.",
    "surf_upgrade": "When the first wave hits opposing Pokemon, it also decreases their movement speed for a short time.",
    "dive": "Dive",
    "dive_description": "Changes the designated are into a puddle and has the user dive into that area, dealing damage to opposing Pokemon and shoving them when they hit. The user also catches Arrokuda or other wild Pokemon as they emerge from the puddle. A maximum of three uses can be kept in reserve for this move.",
    "dive_upgrade": "Increases damage dealt by this move.",
    "feather_dance": "Feather Dance",
    "feather_dance_description": "Decreases the Attack and movement speed of opposing Pokemon for a short time.",
    "hurricane": "Hurricane",
    "hurricane_description": "Creates a fierce wind, dealing damage to opposing Pokemon that get caught in it and throwing them.",
    "hurricane_upgrade": "Increases the user's movement speed for a short time.",
    "air_slash": "Air Slash",
    "air_slash_description": "Has the user shoot out many blades of air while moving backward to create distance. Deals damage to opposing Pokemon in the area of effect and reduces this move's cooldown when it hits.",
    "air_slash_upgrade": "Restores the user's HP every time a blade of air hits an opposing Pokemon.",
    "gatling_gulp_missile": "Gatling Gulp Missile",
    "gatling_gulp_missile_description": "Creates a puddle at the user's current location. The user continuously uses its mouth to grab Arrokuda from the puddle and spits them out to attack the nearest opposing Pokemon. The user cannot move or use other moves while this move is in effect.",
    "gulp_missile": "Gulp Missile",
    "gulp_missile_description": "When the Pokemon uses certain moves, it catches some form of prey in its mouth. Afterward, when the Pokemon receives damage, it spits the prey out as a counterattack at an opposing Pokemon. The type of prey and effect differ based on the user's remaining HP.",
    "squirtle": "Squirtle",
    "wartortle": "Wartortle",
    "blastoise": "Blastoise",
    "blastoise_basic_description": "Becomes a boosted attack with every third attack, dealing continual damage and decreasing the movement speed of opposing Pokemon for a short time when it hits.",
    "water_gun_blastoise": "Water Gun",
    "water_gun_blastoise_description": "Attacks with a shot of water, shoving opposing Pokemon and decreasing their movement speed for a short time.",
    "hydro_pump": "Hydro Pump",
    "hydro_pump_description": "Has the user attack by blasting out a huge volume of water, dealing damage to opposing Pokemon and shoving them when it hits.",
    "hydro_pump_upgrade": "Increases damage dealt by this move.",
    "water_spout": "Water Spout",
    "water_spout_description": "Spouts water toward the designated location, decreasing the movement speed of opposing Pokemon in the area of effect for a short time.",
    "water_spout_upgrade": "Increases damage dealt by this move.",
    "skull_bash": "Skull Bash",
    "skull_bash_description": "Fiercely rams an opposing pokemon and leaves it unable to act.",
    "surf_blastoise": "Surf",
    "surf_blastoise_description": "Has the user charge forward on a wave, shoving opposing pokemon and leaving them unable to act. The user becomes immune to hindrances while using this move and can jump in a designated direction once this move ends.",
    "surf_blastoise_upgrade": "Also grants a shield when this move hits.",
    "rapid_spin": "Rapid Spin",
    "rapid_spin_description": "Has the user spin rapidly, changing the mechanics of its basic attacks as well as its Hydro Pump and Water Spout moves. Using this move resets the cooldown of Hydro Pump or Water Spout. While this move is in effect, the user becomes immune to hindrances. In addition, the user's next basic attack after this move ends becomes a boosted attack.",
    "rapid_spin_upgrade": "Also reduces the damage the user receives while using this move.",
    "hydro_typhoon": "Hydro Typhoon",
    "hydro_typhoon_description": "Has the user spout water to attack while spinning, throwing opposing pokemon in a large area. This also grants the user a shield.",
    "torrent_blastoise": "Torrent",
    "torrent_blastoise_description": "When the Pokemon is at half HP or less, its Attack and Sp. Atk are increased.",
    "chansey": "Chansey",
    "blissey": "Blissey",
    "chansey_basic_description": "Becomes a boosted attack after a set amount of time passes, dealing increased damage.",
    "pound_blissey": "Pound",
    "pound_blissey_description": "Has the user attack by pounding in the designated direction, dealing damage to opposing Pokemon in the area of effect and decreasing their movement speed for a short time when it hits.",
    "egg_bomb": "Egg Bomb",
    "egg_bomb_description": "Hurls an egg at the designated location. The egg then explodes, dealing damage to opposing Pokemon in the area of effect and throwing them.",
    "egg_bomb_upgrade": "Also decreases the movement speed of opposing Pokemon for a short time when they are thrown by this move.",
    "helping_hand": "Helping Hand",
    "helping_hand_description": "For a short time, greatly increases the user's and nearby ally Pokemon's movement speed and basic attack speed. While this move's effects last, all of the user's basic attacks become boosted attacks.",
    "helping_hand_upgrade": "Increases the damage of basic attacks while this move's effects last.",
    "heal_pulse": "Heal Pulse",
    "heal_pulse_description": "Continually restores the user's and designated ally Pokemon's HP for a short time.",
    "soft_boiled": "Soft-Boiled",
    "soft_boiled_description": "Throws an egg to an ally Pokemon, restoring its HP as well as the user's. A maximum of three uses can be kept in reserve for this move.",
    "soft_boiled_upgrade": "Increases the maximum number of uses that can be kept in reserve for this move.",
    "safeguard": "Safeguard",
    "safeguard_description": "Removes all status conditions from the designated ally Pokemon and grants both Pokemon a shield. While these shields are active, the shielded Pokemon become immune to hindrances.",
    "safeguard_upgrade": "Increases the amount of damage nullified by the shield effect.",
    "bliss_assistance": "Bliss Assistance",
    "bliss_assistance_description": "Has the user dash to the designated ally Pokemon to give it an egg, granting that Pokemon a shield and increasing its Attack and Sp. Atk for a short time. The user also intercepts a portion of the damage received by that Pokemon for a short time. While dashing, the user throws nearby opposing pokemon and those it comes in contact with.",
    "natural_cure": "Natural Cure",
    "natural_cure_description": "Removes all status conditions from the Pokemon. This Ability goes on cooldown after it's triggered.",
    "swinub": "Swinub",
    "piloswine": "Piloswine",
    "mamoswine": "Mamoswine",
    "mamoswine_basic_description": "Becomes a boosted attack with every third attack, dealing damage to opposing Pokemon and leaving them frozen for a short time when it hits. In addition, the user's basic attacks deal increased damage for a short time to opposing Pokemon it has frozen with one of its moves.",
    "ice_shard": "Ice Shard",
    "ice_shard_description": "Hurls three chunks of ice at the designated location, dealing damage to opposing Pokemon in the area of effect and decreasing their movement speed for a short time. If an opposing Pokemon is hit by all three chunks, it is left frozen for a short time.",
    "icicle_crash": "Icicle Crash",
    "icicle_crash_description": "Drops icicles on the designated location, dealing damage to opposing Pokemon in the area of effect and decreasing their movement speed for a short time. The final icicle shatters after a set amount of time or when hit by the user's other moves or boosted attacks, dealing damage to opposing Pokemon in the area of effect and leaving them frozen. If the icicle is shattered by Tackle or High Horsepower, the ground is covered in ice, which increases the movement speed of ally Pokemon that run over it.",
    "icicle_crash_upgrade": "The final icicle leaves the opposing Pokemon it hits unable to act for a short time.",
    "ice_fang": "Ice Fang",
    "ice_fang_description": "Uses cold-infused fangs to throw the opposing Pokemon closest to the user, dealing daamge and leaving the Pokemon frozen for a short time. The user can then designate a direction to slam the thrown Pokemon forward or backward, dealing damage to opposing Pokemon in the area of effect and leaving them frozen for a short time.",
    "ice_fang_upgrade": "Increases the area of effect in which opposing Pokemon are left frozen after the slam attack.",
    "tackle_mamoswine": "Tackle",
    "tackle_mamoswine_description": "Has the user rush recklessly in the designated direction, dealing damage to opposing Pokemon it hits and throwing them.",
    "high_horsepower": "High Horsepower",
    "high_horsepower_description": "Has the user rush recklessly in the designated direction, dealing damage to opposing Pokemon it hits and shoving them. The user then stomps its feet, dealing damage to opposing Pokemon in the area of effect and leaving them unable to act for a short time. This stomping deals increased damage to frozen opposing Pokemon.",
    "high_horsepower_upgrade": "Increases the reckless rush's speed and the length of time opposing Pokemon are left unable to act.",
    "earthquake_mamoswine": "Earthquake",
    "earthquake_mamoswine_description": "Has the user leap up in the designated direction and then land forcefully, dealing damage to opposing Pokemon in the area of effect and pulling them toward the user.",
    "earthquake_mamoswine_upgrade": "Decreases the movement speed of opposing Pokemon for a short time when this move hits and increases the move's pulling power.",
    "thick_fat": "Thick Fat",
    "thick_fat_description": "Every time the Pokemon deals damage, its Defense and Sp. Def are increased for a short time (up to three times). When the Pokemon uses Ice Shard, Icicle Crash or Ice Fang, its next basic attack becomes a boosted attack. In addition, if any of these moves creates a freezing area of effect inside an ally goal zone, it decreases the goal-scoring speed of opposing Pokemon inside that goal zone.",
    "mammoth_mash": "Mammoth Mash",
    "mammoth_mash_description": "Has the user jump to the designated location and become immune to hindrances. The user then repeatedly stomps the ground, dealing damage to opposing Pokemon in the area of effect and decreasing their movement speed for a short time with each stomp. The final stomp throws opposing Pokemon in the area of effect.",
    "eevee": "Eevee",
    "sylveon": "Sylveon",
    "sylveon_basic_description": "Becomes a boosted attack with every third attack, dealing increased damage and increasing the user's movement speed for a short time when it hits.",
    "swift": "Swift",
    "swift_description": "Shoots star-shaped rays at opposing Pokemon, deaing damage to them.",
    "mystical_fire": "Mystical Fire",
    "mystical_fire_description": "Has the user create four small flames while advancing in the designated direction. The flames shoot toward opposing Pokemon one by one, dealing damage and decreasing the opposing Pokemon's Sp. Atk for a short time when they hit. Each time a flame hits, it reduces the cooldown of this move.",
    "mystical_fire_upgrade": "Increases the number of flames by one.",
    "hyper_voice": "Hyper Voice",
    "hyper_voice_description": "Unleashes an attack of multiple sound waves that deal damage when they hit. The damage they deal increases the farther the target is from the user. Every time a sound wave hits, the next sound wave's damage increases.",
    "hyper_voice_upgrade": "Increases the number of sound waves by one.",
    "baby_doll_eyes": "Baby-Doll Eyes",
    "baby_doll_eyes_description": "Has the user stare at an opposing Pokemon with its baby-doll eyes, dealing damage and decreasing the opposing Pokemon's Attack and movement speed for a short time when this move hits.",
    "draining_kiss": "Draining Kiss",
    "draining_kiss_description": "Has the user blow a kiss at an opposing Pokemon that goes back and forth between the user and the opposing Pokemon multiple times. When the kiss touches the user, it restores its HP. When it hits the opposing Pokemon, it deals damage to it and decreases its movement speed for a short time. If the user and the opposing Pokemon move too far away from each other, the kiss will disappear faster than normal.",
    "draining_kiss_upgrade": "Increases the amount of HP this move restores.",
    "calm_mind": "Calm Mind",
    "calm_mind_description": "Has the user quietly focus its mind and calm its spirit to increase Sp. Atk, Sp. Def, and movement speed for a short time.",
    "calm_mind_upgrade": "One time only while using this move, if the user is hit by an opposing Pokemon's move, the damage is completely nullified and the user is granted a shield.",
    "fairy_frolic": "Fairy Frolic",
    "fairy_frolic_description": "Has the user jump into the air and briefly become invincible. The moment the user lands, it deals damage to opposing Pokemon in the area of effect and restores its own HP. For a short time afterward, a set percentage of damage dealt by the user is converted into HP for the user.",
    "pixilate": "Pixilate",
    "pixilate_description": "Every time the Pokemon deals or receives damage, its Sp. Atk and Sp. Def are increased for a short time."
}
