{
    "attacker": "Attacker",
    "defender": "Defender",
    "supporter": "Supporter",
    "speedster": "Speedster",
    "all_rounder": "All Rounder",
    "special": "Special",
    "physical": "Physical",
    "melee": "Melee",
    "ranged": "Ranged",
    "area": "Area",
    "buff": "Buff",
    "debuff": "Debuff",
    "hindrance": "Hindrance",
    "dash": "Dash",
    "recovery": "Recovery",
    "sure_hit": "Sure Hit",
    "novice": "Novice",
    "intermediate": "Intermediate",
    "expert": "Expert",
    "offense": "Offense",
    "endurance": "Endurance",
    "mobility": "Mobility",
    "scoring": "Scoring",
    "support": "Support",
    "basic_attack": "Basic Attack",
    "bulbasaur": "Bulbasaur",
    "ivysaur": "Ivysaur",
    "venusaur": "Venusaur",
    "venusaur_basic_description": "Becomes a boosted attack with every third attack, dealing increased damage. This boosted attack also pulls opposing Pokémon inward between the user's vines.",
    "seed_bomb": "Seed Bomb",
    "seed_bomb_description": "Hurls a large seed at the designated area, dealing damage to opposing Pokémon in the area of effect.",
    "sludge_bomb": "Sludge Bomb",
    "sludge_bomb_description": "Hurls unsanitary sludge to the designated area, dealing damage over time to opposing Pokémon in the area of effect and decreasing their movement speed and Sp. Def for a short time.",
    "sludge_bomb_upgrade": "Increases this move's area of effect.",
    "giga_drain": "Giga Drain",
    "giga_drain_description": "Drains nutrients from opposing Pokémon in the area of effect, dealing damage to opposing Pokémon and restoring the user's HP when it hits. Also reduces the damage the user receives for a short time.",
    "giga_drain_upgrade": "Increases the amount of HP this move restores.",
    "razor_leaf": "Razor Leaf",
    "razor_leaf_description": "Launches many sharp-edged leaves in a quick succession of attacks, dealing damage to opposing Pokémon in the area of effect.",
    "solar_beam": "Solar Beam",
    "solar_beam_description": "Blasts a bundled beam of light, dealing damage to opposing Pokémon in the area of effect.",
    "solar_beam_upgrade": "Reduces the length of time before this move fires and reduces its cooldown",
    "petal_dance": "Petal Dance",
    "petal_dance_description": "Scatters petals around the user, increasing movement speed for a short time and dealing damage over time to opposing Pokémon in the area of effect.",
    "petal_dance_upgrade": "Increases this move's area of effect.",
    "verdant_anger": "Verdant Anger",
    "verdant_anger_description": "Launches a giant seed toward the designated area. The seed then splits apart, dealing damage to opposing Pokémon in the area of effect and decreasing their movement speed for a short time.",
    "overgrow": "Overgrow",
    "overgrow_description": "When the Pokémon is at low HP, the damage it deals is increased.",
    "charmander": "Charmander",
    "charmeleon": "Charmeleon",
    "charizard": "Charizard",
    "charizard_basic_description": "Inflicts continuous damage. After evolving, the distance of the basic attack increases. If the opponent is burned the damage inflicted is increased.",
    "flame_burst": "Flame Burst",
    "flame_burst_description": "Attacks with a bursting flame, leaving opposing Pokémon burned.",
    "flamethrower": "Flamethrower",
    "flamethrower_description": "Attacks with an intense blast of fire, leaving opposing Pokémon burned.",
    "flamethrower_upgrade": "Increased damage.",
    "fire_punch": "Fire Punch",
    "fire_punch_description": "Attacks with a heavy punch and unleashes damage. It can burn Pokémon pushed back by it.",
    "fire_punch_upgrade": "Reduces this move's cooldown every time a basic attack hits.",
    "fire_spin": "Fire Spin",
    "fire_spin_description": "Encircles opposing Pokémon in the area of effect with a vortex of fire, also decreasing their movement speed for a short time.",
    "fire_blast": "Fire Blast",
    "fire_blast_description": "Blass intense, all-consuming fire, dealing damage over time to opposing Pokémon while the flames continue to burn on the ground and decreasing the movement speed of opposing Pokémon for a short time.",
    "fire_blast_upgrade": "Increased damage dealt by this move",
    "flare_blitz": "Flare Blitz",
    "flare_blitz_description": "Charges forward cloaked in fire, throwing opposing Pokémon. This also grants the user a shield.",
    "flare_blitz_upgrade": "Also decreases the movement speed of opposing Pokémon for a short time when they are thrown by this move.",
    "seismic_slam": "Seismic Slam",
    "seismic_slam_description": "Flies into the air and shoots down attacks. Ends with a grab of the opponent and throwing them to the ground.",
    "blaze": "Blaze",
    "blaze_description": "When the Pokémon is at half HP or less, its critical-hit rate is increased.",
    "pikachu": "Pikachu",
    "pikachu_basic_description": "Becomes a boosted attack with every third attack, dealing increased damage. This boosted attack also paralyzes opposing Pokémon for a short time when it hits.",
    "thunder_shock": "Thunder Shock",
    "thunder_shock_description": "Releases electricity, dealing damage to opposing Pokémon in the area of effect. Also paralyzes opposing Pokémon for a short time.",
    "electro_ball": "Electro Ball",
    "electro_ball_description": "Hurls an electric orb, dealing damage to opposing Pokémon in the area of effect and leaving them paralyzed for a short time. This move's damage increases the lower the opposing Pokémon's remaining HP is.",
    "electro_ball_upgrade": "Increases damage dealt by this move.",
    "thunder": "Thunder",
    "thunder_description": "Drops wicked thunderbolts, dealing damage to opposing Pokémon in the area of effect.",
    "thunder_upgrade": "Increase the number of times this move attacks.",
    "electro_web": "Electro Web",
    "electro_web_description": "Attacks and captures opposing Pokémon using an electric net, leaving them unable to move.",
    "volt_tackle": "Volt Tackle",
    "volt_tackle_description": "Has the user electrify itself and charge ahead, throwing opposing Pokémon",
    "volt_tackle_upgrade": "Reduces this move's cooldown.",
    "thunderbolt": "Thunderbolt",
    "thunderbolt_description": "Attacks with a strong electric blast, dealing damage to opposing Pokémon in the area of effect and leaving them unable to act.",
    "thunderbolt_upgrade": "Increases damage dealt by this move.",
    "thunderstorm": "Thunderstorm",
    "thunderstorm_description": "Attacks opposing Pokémon near the user with tremendous bolts of lightning.",
    "static": "Static",
    "static_description": "Paralyzes all opponents near the Pokémon for a short time when the Pokémon receives damage. This Ability goes on cooldown after it's triggered.",
    "alolan_vulpix": "Alolan Vulpix",
    "alolan_ninetales": "Alolan Ninetales",
    "alolan_ninetales_basic_description": "Becomes a boosted attack with every third attack. When this boosted attack hits, it deals damage to nearby opposing Pokémon and decreases their movement speed for a short time.",
    "powder_snow": "Powder Snow",
    "powder_snow_description": "Attacks with a chilly gust of powdery snow, decreasing the movement speed of opposing Pokémon for a short time when it hits.",
    "avalanche": "Avalanche",
    "avalanche_description": "Attacks with a gush of chilly ice toward the designated area. The ice forms a wall that cannot be passed through on land. After a short time, this wall melts and collapses, dealing damage to opposing Pokémon in the area of effect.",
    "avalanche_upgrade": "Also decreases the movement speed of opposing Pokémon for a short time when this move hits.",
    "dazzling_gleam": "Dazzling Gleam",
    "dazzling_gleam_description": "Attacks with a powerful cone of blinding light, leaving opposing Pokémon unable to act when this move hits.",
    "dazzling_gleam_upgrade": "Increases damage dealt and the length of time opposing Pokémon are unable to act.",
    "icy_wind": "Icy Wind",
    "icy_wind_description": "Attacks with a gust of freezing air, decreasing the movement speed of opposing Pokémon fro a short time when it hits.",
    "blizzard": "Blizzard",
    "blizzard_description": "Summons a howling blizzard in front of the user, decreasing the movement speed of opposing Pokémon for a short time and shoving nearby Pokémon. When the blizzard hits an obstacle, it splits and spreads out to the left and right.",
    "blizzard_upgrade": "Increases damage dealt by this move.",
    "aurora_veil": "Aurora Veil",
    "aurora_veil_description": "Creates an aurora around the user that reduces damage received by the user and ally Pokémon in the area of effect. Also increases the user's movement speed and makes all of their basic attacks boosted attacks while this move is in effect.",
    "aurora_veil_upgrade": "Further reduces damage ally Pokémon receive.",
    "snow_globe": "Snow Globe",
    "snow_globe_description": "Attacks with a chilly snow and ice, dealing damage to opposing Pokémon in the area of effect when it hits. Deals increased damage to opposing Pokémon that are frozen.",
    "snow_warning": "Snow Warning",
    "snow_warning_description": "Causes snow to fall on an opposing Pokemon, dealing damage to it and decreasing its movement speed for a short time. Boosted attacks and moves (except Aurora Veil) sling snow, and hitting the same target with snow multiple times will freeze it for a short time.",
    "jigglypuff": "Jigglypuff",
    "wigglytuff": "Wigglytuff",
    "wigglytuff_basic_description": "Becomes a boosted attack with every third attack, dealing damage to opposing Pokémon and spinning them around when it hits.",
    "pound": "Pound",
    "pound_description": "Has the user perform a combo attack in front of itself, dealing damage to opposing Pokémon and decreasing their movement speed for a short time when the attack hits.",
    "double_slap": "Double Slap",
    "double_slap_description": "Has the user perform a combo attack in front of itself, dealing damage to opposing Pokémon and decreasing their movement speed for a short time when the attack hits.",
    "double_slap_upgrade": "Increases the amount of attacks unleashed.",
    "dazzling_gleam__1": "Dazzling Gleam",
    "dazzling_gleam_description__1": "Emits a powerful flash in the designated direction, dealing damage to opposing Pokémon in the area of effect twice.",
    "dazzling_gleam_upgrade__1": "Also decreases the movement speed of opposing Pokémon for a short time when the first hit of this move deals damage to them",
    "defense_curl": "Defense Curl",
    "defense_curl_description": "Has the user perform a quick roll, granting it a shield and throwing any opposing Pokémon hit by the roll. Hitting an obstacle while rolling will change the direction the user is moving and reset the cooldown of Pound, Double Slap, or Dazzling Gleam.",
    "rollout": "Rollout",
    "rollout_description": "Has the user perform a quick roll, granting it a shield and throwing any opposing Pokémon hit by the roll. Hitting an obstacle while rolling will change the direction the user is moving and reset the cooldown of Pound, Double Slap, or Dazzling Gleam.",
    "rollout_upgrade": "Increases the length of time opposing Pokémon are thrown.",
    "sing": "Sing",
    "sing_description": "Has the user sing, decreasing the movement speed of nearby opposing Pokémon for a short time. Opposing Pokémon that stay in the move's area of effect for a while are put to sleep for a short time which also decreases their Defense and Sp. Def.",
    "sing_upgrade": "Increases the length of time that opposing Pokémon stay asleep.",
    "star_recital": "Star Recital",
    "star_recital_description": "Has the user begin performing a recital, granting itself and nearby ally Pokémon a shield as well as removing all status conditions from the affected Pokémon and making them immune to hindrances for a short time.",
    "cute_charm": "Cute Charm",
    "cute_charm_description": "When a Pokémon is hit by an opposing Pokémon's attack at close range, it makes that opposing Pokémon infatuated for a short time. Infatuated opposing Pokémon become enthralled and approach the infatuating Pokémon against their will. THe effects of this ability have a cooldown and cannot trigger on the same opposing Pokémon in quick succession.",
    "machop": "Machop",
    "machoke": "Machoke",
    "machamp": "Machamp",
    "machamp_basic_description": "Every third basic attack is a boosted attack that deals increased damage when it lands successfully.",
    "karate_chop": "Karate Chop",
    "karate_chop_description": "Attacks opposing Pokémon with a sharp chop.",
    "close_combat": "Close Combat",
    "close_combat_description": "Unleashes a series of punches in the designated direction, dealing increased damage with the last punch. The user can move while using this move and becomes immune to hindrances.",
    "close_combat_upgrade": "Deals increased damage to Pokémon that are affected by a status condition.",
    "cross_chop": "Cross Chop",
    "cross_chop_description": "Has the user deliver a double chop with forearms crossed while dashing forward. This also increases the user's critical-hit rate.",
    "cross_chop_upgrade": "Increases Attack with each basic attack, up to a set max.",
    "bulk_up": "Bulk Up",
    "bulk_up_description": "After using this move, the user becomes immune to hindrances for a short time, their movement speed and Attack are increased, and their basic attack speed is increased. The user's next basic attack also becomes a boosted attack.",
    "dynamic_punch": "Dynamic Punch",
    "dynamic_punch_description": "Has the user jump to the designated location, dealing damage to opposing Pokémon in the area of effect nd leaving them unable to act when it hits. After using this move, the user becomes immune to hindrances for a short time, their movement speed is increased, and their basic attack speed is increased. The user's next basic attack also becomes a boosted attack.",
    "dynamic_punch_upgrade": "Further increases Attack and movement Speed.",
    "submission": "Submission",
    "submission_description": "The Pokémon's movement Speed is increased and it can't be stunned. Increases the damage of the next basic attack and knocks the opponent Pokémon back, making them unable to move. Increases Critical Hit and makes Basic Attacks faster for a short time.",
    "submission_upgrade": "Further increases critical-hit rate and increases basic attack speed.",
    "barrage_blow": "Barrage Blow",
    "barrage_blow_description": "Increases the user's movement speed, Attack, Defense and Sp. Def for a short time. If used again, unleashes a combo attack, dealing damage to opposing Pokémon in the area of effect and shoving them. The final blow deals an especially large amount of damage.",
    "guts": "Guts",
    "guts_description": "Increases the Pokemon's Attack when the Pokemon is afflicted by a status condition.",
    "slowpoke": "Slowpoke",
    "slowbro": "Slowbro",
    "slowbro_basic_description": "Becomes a boosted attack with every third attack. When this boosted attack hits, it deals damage to opposing Pokémon in the area of effect and decreases their Sp. Def for a short time.",
    "water_gun": "Water Gun",
    "water_gun_description": "Shoots water forcefully, dealing damage to opposing Pokémon and decreasing their movement speed for a short time when it hits. Holding down the button for this move increases its area of effect and damage.",
    "scald": "Scald",
    "scald_description": "Sends out a stream of boiling water, causing damage to the opponent. The opponent Pokémon may be burned and have its movement speed reduced.",
    "scald_upgrade": "Increases the vapor's area of effect.",
    "surf": "Surf",
    "surf_description": "Has the user charge forward on waves. The first wave deals damage to opposing Pokémon in the area of effect and throws them.",
    "surf_upgrade": "The second and third waves become larger and also throw opposing Pokémon like the first wave does.",
    "slack_off": "Slack Off",
    "slack_off_description": "Increases Hit Points gradually. If damaged during the time, the amount of Hit Points increased reduces.",
    "amnesia": "Amnesia",
    "amnesia_description": "Reduces damage of weaker attacks. Increases the Pokémon's Defense and increases damage of Scald or Surf once after use.",
    "amnesia_upgrade": "Inceases Sp. Atk.",
    "telekenisis": "Telekenisis",
    "telekenisis_description": "Makes opposing Pokémon float with psychic power. If used again, pulls the opposing Pokémon toward the user.",
    "telekenisis_upgrade": "Increases this move's firing speed and range.",
    "slowbeam": "Slowbeam",
    "slowbeam_description": "Has the user stare at an opposing Pokémon and attack continually, dealing damage and binding them. Shields the user and makes them unstoppable while they're using this move.",
    "oblivious": "Oblivious",
    "oblivious_description": "When the Pokémon receives damage, the HP loss is gradual. When damaging an opposing Pokémon with a move, the Pokémon nullifies some of this pending damage before it takes effect, and it also decreases the opposing Pokémon's Sp. Def for a short time.",
    "gastly": "Gastly",
    "haunter": "Haunter",
    "gengar": "Gengar",
    "gengar_basic_description": "Becomes a boosted attack with every third attack, dealing increased damage to nearby Pokémon when it hits.",
    "will_o_wisp": "Will O_wisp",
    "will_o_wisp_description": "Shoots multiple sinister flames, dealing damage to opposing Pokémon and leaving them burned when it hits.",
    "shadow_ball": "Shadow Ball",
    "shadow_ball_description": "Hurls a shadowy blob at the target, decreasing the movement speed and Sp. Def of opposing Pokémon for a short time when it hits.",
    "shadow_ball_upgrade": "Increases damage dealt by this move.",
    "sludge_bomb__1": "Sludge Bomb",
    "sludge_bomb_description__1": "Hurls unsanitary sludge to the designated area, leaving opposing Pokémon poisoned when it hits.",
    "sludge_bomb_upgrade__1": "Increases the poison effect's duration.",
    "lick": "Lick",
    "lick_description": "Attacks with the user's tongue and pulls opposing Pokémon towards the user.",
    "dream_eater": "Dream Eater",
    "dream_eater_description": "When the attack hits, it puts the opposing Pokémon in a Sleepy Stage. If it hits again, the Pokémon sneaks up behind the opponent and attacks, doing damage and healing the user of that damage. Wait time for Shadow Ball and Sludge Bomb is reduced.",
    "dream_eater_upgrade": "Increases the amount of damage dealt and HP restored by this move.",
    "hex": "Hex",
    "hex_description": "Has the user disappear and then reappear at the designated location, dealing damage to opposing Pokémon in the area of effect. If this hits an opposing Pokémon that is affected by a status condition, it deals increased damage and its cooldown is reduced.",
    "hex_upgrade": "Increases damage dealt by this move.",
    "phantom_ambush": "Phantom Ambush",
    "phantom_ambush_description": "Has the user jump to the designated area and allows them to start sneaking with increased movement speed. If used again, deals damage to opposing Pokémon in the area of effect and decreases their movement speed for a short time.",
    "levitate": "Levitate",
    "levitate_description": "When the Pokémon is not in combat, its movement speed is increased.",
    "mr_mime": "Mr Mime",
    "mime_basic_description": "Becomes a boosted attack with every third attack, dealing increased damage and throwing opposing Pokémon when it hits.",
    "fake_out": "Fake Out",
    "fake_out_description": "Has the user slap its hands together, shoving opposing Pokémon in front of it.",
    "confusion": "Confusion",
    "confusion_description": "Attacks straight in front of the user, dealing damage to opposing Pokémon and shoving it. If an opposing Pokémon shoved by this move hits an obstacle, it receives increased damage from this move and is left unable to act for a short time. If the opposing Pokémon us currently guard-swapped, it is not shoved but receives increased damage from this move and is left unable to act for a short time.",
    "confusion_upgrade": "Increases damage dealt by this move.",
    "psychic": "Psychic",
    "psychic_description": "Centers one telekinetic blast each on the user, any guard-swapped opposing Pokémon, and any Light Screen or Barrier walls created by the user, damaging all opposing Pokémon caught in the blasts and lowering their Sp. Def for a short time. If an opposing Pokémon is hit by multiple overlapping blasts, that Pokémon is also left unable to act for a short time.",
    "psychic_upgrade": "Also decreases the movement speed of opposing Pokémon for a short time.",
    "light_screen": "Light Screen",
    "light_screen_description": "Creates a wall of light in the designated area that prevents opposing Pokémon from passing.",
    "barrier": "Barrier",
    "barrier_description": "Creates a translucent wall in the designated location that prevents opposing Pokémon from passing. A maximum of two uses can be kept in reserve for this move.",
    "barrier_upgrade": "Increases the maximum number of uses that can be kept in reserve for this move.",
    "guard_swap": "Guard Swap",
    "guard_swap_description": "Swaps the user's Defense and Sp. def stats with those of another Pokémon for a short time when it hits. Swapping with an opposing Pokémon deals its damage over time and decreases its movement speed while increasing the user's movement speed for a short time. Swapping with an ally Pokémon increases the movement speed of that Pokémon and the user for a short time.",
    "guard_swap_upgrade": "Also continually restores the HP of the user and the ally Pokémon while this move is in effect.",
    "showtime": "Showtime",
    "showtime_description": "Has the user jump to the designated location and start a pantomime performance, dealing damage over time to opposing Pokémon in the area of effect and leaving them unable to act for a short time.",
    "filter": "Filter",
    "filter_description": "Reduces damage received by the Pokémon for a short time after it uses a move.",
    "snorlax": "Snorlax",
    "snorlax_basic_description": "Becomes a boosted attack with every third attack. When this boosted attack hits, it deals damage to nearby opposing Pokémon and decreases their movement speed for a short time.",
    "tackle": "Tackle",
    "tackle_description": "Has the user charge forward belly first, dealing damage to opposing Pokémon in the area of effect and decreasing their movement speed for a short time.",
    "heavy_slam": "Heavy Slam",
    "heavy_slam_description": "Has the user slam their heavy body down, dealing damage to opposing Pokémon in the area of effect and throwing them.",
    "heavy_slam_upgrade": "Increases damage dealt by this move.",
    "flail": "Flail",
    "flail_description": "Has the user flail about, increasing the user's basic attack damage the lower the user's HP is.",
    "flail_upgrade": "Increases the damage of this move. If the user has low HP while using this move, its basic attacks that hit opposing Pokémon will restore the user's HP.",
    "rest": "Rest",
    "rest_description": "Has the user fall asleep on the spot and restores their HP. Blocks the movement of all Pokémon not on the user's team while this move is in effect.",
    "block": "Block",
    "block_description": "Has the user spread their arms wide to create a wall and grants it a shield. Prevents opposing Pokémon from passing through the wall and shoves them if they run into it.",
    "block_upgrade": "Reduces the damage the user receives while this move is in effect.",
    "yawn": "Yawn",
    "yawn_description": "Has the user let loose a huge yawn that lulls opposing Pokémon into a sleepy haze, putting opposing Pokémon hit by this move to sleep.",
    "yawn_upgrade": "Also decreases the movement speed of opposing Pokémon for a short time when this move hits.",
    "power_nap": "Power Nap",
    "power_nap_description": "Has the user fall asleep and begin to snore, dealing damage over time to opposing Pokémon in the area of effect while restoring the user's HP. Using certain moves while asleep allows the user to roll over, dealing further damage to opposing Pokémon in the area of effect.",
    "gluttony": "Gluttony",
    "gluttony_description": "Increases the effects gained from eating Berries.",
    "ralts": "Ralts",
    "kirlia": "Kirlia",
    "gardevoir": "Gardevoir",
    "gardevoir_basic_description": "Becomes a boosted attack with every third attack. When this boosted attack hits, it deals damage to opposing Pokémon in the area of effect and decreases their Sp. Def for a short time.",
    "confusion__1": "Confusion",
    "confusion_description__1": "Attacks straight in the designated direction.",
    "psychic__1": "Psychic",
    "psychic_description__1": "After hitting an opposing Pokémon or traveling its maximum distance, creates a circle that deals damage to opposing Pokémon in the area of effect, decreasing their movement speed for a short time.",
    "psychic_upgrade__1": "Reduces this move's cooldown.",
    "moonblast": "Moonblast",
    "moonblast_description": "Has the user attack while moving back to create distance. When the move's blast hits, it deals damage to opposing Pokémon in a cone and leaves the opposing Pokémon closest to the user unable to act for a short time.",
    "moonblast_upgrade": "Also grants the user a shield when this move is used.",
    "teleport": "Teleport",
    "teleport_description": "Has the user warp to the designated area, increasing the damage dealt by one basic attack after warping.",
    "psyshock": "Psyshock",
    "psyshock_description": "Attacks the designated location three times. This move's cooldown is reduced each time one of these attacks hits an opposing Pokémon.",
    "psyshock_upgrade": "Also increases the damage this move deals each time one of its attacks hits.",
    "future_sight": "Future Sight",
    "future_sight_description": "Sets a delayed explosion. When the explosion hits an opposing Pokémon, it shortens this move's cooldown.",
    "future_sight_upgrade": "Resets this move's cooldown when the explosion hits an opposing Pokémon.",
    "fairy_singularity": "Fairy Singularity",
    "fairy_singularity_description": "Warps space in the designated area, drawing in opposing Pokémon. Shoves and deals damage to opposing Pokémon the instant the warped space disappears.",
    "synchronize": "Synchronize",
    "synchronize_description": "When an opponent inflicts decreased movement speed or a damage-over-time condition on the Pokémon, the same is inflicted on that opponent. This ability goes on cooldown after it's triggered.",
    "absol": "Absol",
    "absol_basic_description": "Becomes a boosted attack with every third attack, dealing damage to opposing Pokémon and lowering their Defense when it hits. If this boosted attack hits only a single opposing Pokémon, it deals increased damage.",
    "feint": "Feint",
    "feint_description": "Has the user dash in an arc, attacking opposing Pokémon they come in contact with. This move ignores the Defense stat and shield effects of opposing Pokémon.",
    "night_slash": "Night Slash",
    "night_slash_description": "Slashes in an outward arc, lowering the movement speed of opposing Pokémon for a short time when it hits. If used again, increases the user's critical-hit rate and has the user dash to the designated location, dealing damage to opposing Pokémon they come in contact with.",
    "night_slash_upgrade": "Using this move again will restore the user's HP.",
    "pursuit": "Pursuit",
    "pursuit_description": "Has the user dash to the designated location and quickly charge an opposing Pokémon with the next basic attack. If the basic attack lands from behind, its damage is increased and this move's cooldown is reduced",
    "pursuit_upgrade": "Increases movement speed.",
    "slash": "Slash",
    "slash_description": "Slashes with sharp claws in front of the user and increases the user's critical-hit rate.",
    "psycho_cut": "Psycho Cut",
    "psycho_cut_description": "Damages the opponent with a large slash. Decreases opponent's movement Speed and increases the power of the user's Basic Attack up to 3 times.",
    "psycho_cut_upgrade": "Also increases the user's movement speed for a short time when this move hits.",
    "sucker_punch": "Sucker Punch",
    "sucker_punch_description": "Attacks the opposing Pokémon. Reduces user and opponent's movement Speed but attacks after a while. If you are attacked or the opponent Pokémon attacks, the user will rush and attack the Pokémon immaediately.",
    "sucker_punch_upgrade": "Increases basic attack speed for a short time when this move hits.",
    "midnight_slash": "Midnight Slash",
    "midnight_slash_description": "Unleashes a flurry of slashes in front of the user. This move ends by unleashing powerful blades of energy, dealing increased damage to opposing Pokémon and shoving them.",
    "super_luck": "Super Luck",
    "super_luck_description": "Increases the Pokémon's critical-hit rate.",
    "gible": "Gible",
    "gabite": "Gabite",
    "garchomp": "Garchomp",
    "garchomp_basic_description": "Becomes a boosted attack with every fifth attack, dealing increased damage and restoring the user's HP. Every time one of the user's basic attacks or moves hits an opposing Pokémon, the user's basic attack speed is increased",
    "sand_attack": "Sand Attack",
    "sand_attack_description": "Hurls sand at opposing Pokémon, narrowing their field of vision and increasing the user's movement speed and basic attack speed when it hits.",
    "dig": "Dig",
    "dig_description": "Has the user burrow underground and move out quickly in the designated direction, jumping out when it comes in contact with an opposing Pokémon or when it has traveled the maximum distance. This jump deals damage to opposing Pokémon in the area of effect and throws them.",
    "dig_upgrade": "Reduces the damage the user receives for a short time after it jumps out from the ground.",
    "dragon_rush": "Dragon Rush",
    "dragon_rush_description": "Has the user dive in the designated direction, shoving opposing Pokémon.",
    "dragon_rush_upgrade": "Decreases the movement speed of opposing Pokémon for a short time when they are shoved by this move the maximum distance.",
    "bulldoze": "Bulldoze",
    "bulldoze_description": "Has the user stomp down on the ground, dealing damage to opposing Pokémon in the area of effect.",
    "earthquake": "Earthquake",
    "earthquake_description": "Has the user jump high into the air and crash forcefully to the ground, dealing damage to opposing Pokémon in the area of effect.",
    "earthquake_upgrade": "Also decreases the movement speed of opposing Pokémon for a short time if they are in this move's area of effect.",
    "dragon_claw": "Dragon Claw",
    "dragon_claw_description": "Has the user attack in two parts while dashing forward. The first deals damage to opposing Pokémon and throws them. The second deals increased damage and increases the user's basic attack speed.",
    "dragon_claw_upgrade": "Increases damage dealt by this move.",
    "livid_outrage": "Livid Outrage",
    "livid_outrage_description": "Has the user unleash a powerful chain attack while dashing forward. The final attack thros opposing Pokémon but also leaves the user unable to act for a short time.",
    "rough_skin": "Rough Skin",
    "rough_skin_description": "When the Pokémon is struck by a melee attack, a portion of the damage received is reflected back at the attacker.",
    "lucario": "Lucario",
    "lucario_basic_description": "Becomes a boosted attack with every third attack, performing a combo attack with a bone. Deals damage to opposing Pokémon in the area of effect and throws them",
    "quick_attack": "Quick Attack",
    "quick_attack_description": "Has the user lunge forward at a speed that makes them almost invisible, dealing damage to opposing Pokémon they come in contact with.",
    "extreme_speed": "Extreme Speed",
    "extreme_speed_description": "Rushes the opponent, moving to a close difference and attacking. Reduces wait time to 0 and increases HP.",
    "extreme_speed_upgrade": "Increases Attack for a short time.",
    "power_up_punch": "Power Up_punch",
    "power_up_punch_description": "Charges power before unleashing a powerful attack. While the user is charging power, itsm ovement speed is decreased but its Attack slowly increases and the damage it receives is reduced. The user then charges in the designated direction and releases the move, dealing more damage the lower the opposing Pokémon's remaining HP is and making its own next basic attack a boosted attack if the move hits. This move's cooldown is reduced every time one of the user's move hits.",
    "power_up_punch_upgrade": "The user becomes immune to hindrances while charging power.",
    "meteor_mash": "Meteor Mash",
    "meteor_mash_description": "Blasts forward with a punch like a comet, dealing damage to opposing Pokémon and shoving them.",
    "bone_rush": "Bone Rush",
    "bone_rush_description": "Performs a combo attack with a bone, dealing multiple damaging blows to opposing Pokémon and leaving them unable to act for a short time. The final attack sends the bone flying. If used again, the move has the user rush to the location of the bone.",
    "bone_rush_upgrade": "Resets all the user's move cooldowns when this move is used a second time.",
    "close_combat__1": "Close Combat",
    "close_combat_description__1": "Unleashes a combo attack, dealing multiple blows to opposing Pokémon and shoving them.",
    "close_combat_upgrade__1": "When this move is used, it grants the user a shield. While using this move, the user becomes immune to hindrances.",
    "aura_cannon": "Aura Cannon",
    "aura_cannon_description": "Damages all opposing Pokémon in range. After hitting, the damage by the next Power-Up Punch increases.",
    "steadfast": "Steadfast",
    "steadfast_description": "When the Pokémon is at low HP, it is shielded and its movement speed is increased.",
    "dwebble": "Dwebble",
    "crustle": "Crustle",
    "crustle_basic_description": "",
    "rock_slide": "Rock Slide",
    "rock_slide_description": "",
    "rock_tomb": "Rock Tomb",
    "rock_tomb_description": "",
    "rock_tomb_upgrade": "",
    "shell_smash": "Shell Smash",
    "shell_smash_description": "",
    "shell_smash_upgrade": "",
    "fury_cutter": "Fury Cutter",
    "fury_cutter_description": "",
    "stealth_rock": "Stealth Rock",
    "stealth_rock_description": "",
    "stealth_rock_upgrade": "",
    "x_scissor": "X Scissor",
    "x_scissor_description": "",
    "x_scissor_upgrade": "",
    "rubble_rouser": "Rubble Rouser",
    "rubble_rouser_description": "",
    "sturdy": "Sturdy",
    "sturdy_description": "",
    "froakie": "Froakie",
    "frogadier": "Frogadier",
    "greninja": "Greninja",
    "greninja_basic_description": "",
    "bubble": "Bubble",
    "bubble_description": "",
    "water_shuriken": "Water Shuriken",
    "water_shuriken_description": "",
    "water_shuriken_upgrade": "",
    "surf__1": "Surf",
    "surf_description__1": "",
    "surf_upgrade__1": "",
    "substitute": "Substitute",
    "substitute_description": "",
    "double_team": "Double Team",
    "double_team_description": "",
    "double_team_upgrade": "",
    "smokescreen": "Smokescreen",
    "smokescreen_description": "",
    "smokescreen_upgrade": "",
    "waterburst_shuriken": "Waterburst Shuriken",
    "waterburst_shuriken_description": "",
    "torrent": "Torrent",
    "torrent_description": "",
    "fletchling": "Fletchling",
    "fletchinder": "Fletchinder",
    "talonflame": "Talonflame",
    "talonflame_basic_description": "",
    "peck": "Peck",
    "peck_description": "",
    "flame_charge": "Flame Charge",
    "flame_charge_description": "",
    "flame_charge_upgrade": "",
    "aerial_ace": "Aerial Ace",
    "aerial_ace_description": "",
    "aerial_ace_upgrade": "",
    "acrobatics": "Acrobatics",
    "acrobatics_description": "",
    "fly": "Fly",
    "fly_description": "",
    "fly_upgrade": "",
    "brave_bird": "Brave Bird",
    "brave_bird_description": "",
    "brave_bird_upgrade": "",
    "flame_sweep": "Flame Sweep",
    "flame_sweep_description": "",
    "gale_wings": "Gale Wings",
    "gale_wings_description": "",
    "zeraora": "Zeraora",
    "zeraora_basic_description": "",
    "agility": "Agility",
    "agility_description": "",
    "volt_switch": "Volt Switch",
    "volt_switch_description": "",
    "volt_switch_upgrade": "",
    "spark": "Spark",
    "spark_description": "",
    "spark_upgrade": "",
    "slash__1": "Slash",
    "slash_description__1": "",
    "discharge": "Discharge",
    "discharge_description": "",
    "discharge_upgrade": "",
    "wild_charge": "Wild Charge",
    "wild_charge_description": "",
    "wild_charge_upgrade": "",
    "plasma_gale": "Plasma Gale",
    "plasma_gale_description": "",
    "volt_absorb": "Volt Absorb",
    "volt_absorb_description": "",
    "scorbunny": "Scorbunny",
    "raboot": "Raboot",
    "cinderace": "Cinderace",
    "cinderace_basic_description": "",
    "ember": "Ember",
    "ember_description": "",
    "pyro_ball": "Pyro Ball",
    "pyro_ball_description": "",
    "pyro_ball_upgrade": "",
    "blaze_kick": "Blaze Kick",
    "blaze_kick_description": "",
    "blaze_kick_upgrade": "",
    "low_sweep": "Low Sweep",
    "low_sweep_description": "",
    "flame_charge__1": "Flame Charge",
    "flame_charge_description__1": "",
    "flame_charge_upgrade__1": "",
    "feint__1": "Feint",
    "feint_description__1": "",
    "feint_upgrade": "",
    "blazing_bicycle_kick": "Blazing Bicycle_kick",
    "blazing_bicycle_kick_description": "",
    "blaze__1": "Blaze",
    "blaze_description__1": "",
    "gossifleur": "Gossifleur",
    "eldegoss": "Eldegoss",
    "eldegoss_basic_description": "",
    "leafage": "Leafage",
    "leafage_description": "",
    "pollen_puff": "Pollen Puff",
    "pollen_puff_description": "",
    "pollen_puff_upgrade": "",
    "leaf_tornado": "Leaf Tornado",
    "leaf_tornado_description": "",
    "leaf_tornado_upgrade": "",
    "synthesis": "Synthesis",
    "synthesis_description": "",
    "cotton_guard": "Cotton Guard",
    "cotton_guard_description": "",
    "cotton_guard_upgrade": "",
    "cotton_spore": "Cotton Spore",
    "cotton_spore_description": "",
    "cotton_spore_upgrade": "",
    "cotton_cloud_crash": "Cotton Cloud_crash",
    "cotton_cloud_crash_description": "",
    "cotton_down": "Cotton Down",
    "cotton_down_description": "",
    "cramorant": "Cramorant",
    "cramorant_basic_description": "",
    "whirlpool": "Whirlpool",
    "whirlpool_description": "",
    "surf__2": "Surf",
    "surf_description__2": "",
    "surf_upgrade__2": "",
    "dive": "Dive",
    "dive_description": "",
    "dive_upgrade": "",
    "feather_dance": "Feather Dance",
    "feather_dance_description": "",
    "hurricane": "Hurricane",
    "hurricane_description": "",
    "hurricane_upgrade": "",
    "air_slash": "Air Slash",
    "air_slash_description": "",
    "air_slash_upgrade": "",
    "gatling_gulp_missile": "Gatling Gulp_missile",
    "gatling_gulp_missile_description": "",
    "gulp_missile": "Gulp Missile",
    "gulp_missile_description": ""
}
